"""Задача 4. Заглавные буквы"""


def main():
    """main function
    """
    line = input('Введите строку: ')
    print(f'Результат: {line.title()}')


main()
